const mongoose = require('mongoose');

const campaignSchema = new mongoose.Schema({
    // ১. মালিকের তথ্য (কে এই ক্যাম্পেইন চালু করেছে)

    timeRequired: { 
        type: Number, 
        default: 60 // ইউজাররা চাইলে টাকা বেশি দিয়ে টাইম বাড়াতে পারবে ভবিষ্যতে
    },

    owner: {
        type: mongoose.Schema.Types.ObjectId,
        ref: 'User',
        required: true
    },

    // ২. প্ল্যাটফর্ম এবং টাস্কের ধরন
    platform: {
        type: String,
        enum: ['youtube', 'facebook', 'tiktok'], // ভবিষ্যতে ইনস্টাগ্রাম এড হবে
        required: true
    },
    actionType: {
        type: String,
        enum: ['subscribe', 'view', 'follow', 'like'],
        required: true
    },
    targetUrl: {
        type: String,
        required: true
    },
    
    // ৩. ক্যাম্পেইন সেটিংস ও খরচ
    targetAmount: {
        type: Number,
        required: true // মোট কতগুলো সাবস্ক্রাইব চায়
    },
    completedCount: {
        type: Number,
        default: 0 // এখন পর্যন্ত কয়টা হয়েছে
    },
    costPerAction: {
        type: Number,
        default: 10 // ফ্রি ইউজারদের পয়েন্ট খরচ
    },

    // ৪. স্পেশাল ১+১ লজিক এবং প্রিমিয়াম স্লট 🔥
    isPremiumSlot: {
        type: Boolean,
        default: false 
    }, 
    // যদি true হয়, তবে সিস্টেম একে ফ্রি টাস্কের সাথে "জোড়া" লাগিয়ে দেবে (1+1)
    
    priority: {
        type: Number,
        default: 1 // প্রিমিয়াম হলে ১০, ফ্রি হলে ১
    },

    // ৫. লুপ সিস্টেম (Loop System) 🔄
    // এই অ্যারেতে তাদের আইডি থাকবে যারা অলরেডি এই কাজটা করে ফেলেছে।
    // সিস্টেম চেক করবে: যদি ইউজারের আইডি এখানে থাকে, তবে তাকে আর দেখাবে না।
    completedBy: [{
        type: mongoose.Schema.Types.ObjectId,
        ref: 'User'
    }],

    // ৬. স্ট্যাটাস কন্ট্রোল
    status: {
        type: String,
        enum: ['active', 'paused', 'completed', 'banned'],
        default: 'active'
    }

}, { timestamps: true });

// পারফরম্যান্স অপটিমাইজেশন (Searching Fast করার জন্য)
campaignSchema.index({ status: 1, isPremiumSlot: -1, priority: -1 });

module.exports = mongoose.model('Campaign', campaignSchema);